meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "АГРИТЬСЯ": "Злиться",
            "РОФЛ": "Шутка",
            "ЩИЩ": "Одобрение или восторг",
            "КРИПОВЫЙ": "Страшный, пугающий",
            "ХЗ": "Не знаю, не имею понятия",
            "МБ": "Может быть"
            }

word = input("Введите непонятное слово (большими буквами!): ")

if word in meme_dict.keys():
    print(meme_dict[word], ".",  "Удивительно, что мы его нашли ...")
else:
    print('Увы, такого слова мы не знаем мб :3 Не обижайся, найдешь)')
